//
//  ViewModel.swift
//  ChristmasTV
//
//  Created by Angelos Staboulis on 22/12/24.
//

import Foundation
class ViewModel:ObservableObject{
    func createHistory()->[String]{
        var history:[String] = []
        history.append("""
        Η παράδοση θεωρεί ότι η αρχαιότερη ομιλία για τη γιορτή των Χριστουγέννων εκφωνήθηκε από τον Μέγα Βασίλειο στην Καισάρεια της Καππαδοκίας το έτος 376 μ.Χ.[3] Άλλες Ιστορικές πηγές επισημαίνουν πως ο εορτασμός των Χριστουγέννων άρχισε να τηρείται στη Ρώμη γύρω στο 335[4], αν και κάποιοι ερευνητές βασιζόμενοι σε αρχαίους ύμνους με χριστουγεννιάτικη θεματολογία[5] θεωρούν ότι τα πρώτα βήματα που οδήγησαν στον εορτασμό αυτό έγιναν μέσα στον 3ο αιώνα.
        Επί Πάπα Ιουλίου Α' (337-352) τα Χριστούγεννα σταμάτησαν να γιορτάζονται μαζί με τα Θεοφάνια και θεσπίσθηκε ως επέτειος η 25 Δεκεμβρίου κατόπιν έρευνας των αρχείων της Ρώμης, όπως πιστεύεται, επί της απογραφής που έγινε επί αυτοκράτορα Οκταβιανού Αυγούστου, σε συνδυασμό με υπολογισμό ρήσης του Ευαγγελίου (το οποίο και συνέτεινε) του Προδρόμου λεχθείσα περί τον Χριστόν:"Εκείνος δει αυξάνειν, εμέ δε ελατούσθαι" (Ιωάνν. γ'30). Με βάση αυτή την υποθετική πηγή, η Γέννηση του Χριστού ορίσθηκε κατά το χειμερινό ηλιοστάσιο όπου και αρχίζει η αύξηση των ημερών. Στον καθορισμό της 25ης Δεκεμβρίου ως ημερομηνίας εορτασμού συντέλεσαν προφανώς η μεγάλη εθνική εορτή του "ανίκητου" θεού Ήλιου (Dies Natalis Solis Invicti) και ο εορτασμός των γενεθλίων του Μίθρα που ήταν διαδεδομένα σε όλη την επικράτεια της Ρωμαϊκής αυτοκρατορίας με την έννοια ότι η επιλογή αυτής της ημέρας ως ημέρας γέννησης του Χριστού είχε να κάνει με την προσπάθεια αντικατάστασης των παγανιστικών (μη χριστιανικών) γιορτών που τηρούνταν εκείνον τον καιρό, όπως τα Σατουρνάλια και τα Μπρουμάλια[6]              
        """)
        history.append("""
        Συνεπώς, όταν ο Χριστιανισμός έγινε η επίσημη θρησκεία της αυτοκρατορίας, προσπάθησε να απορροφήσει και να δώσει νέα διάσταση και νέα σημασία σε πανάρχαια λατρευτικά έθιμα και λατρευτικές συνήθειες αιώνων. Πάντως, παρά τις απαγορεύσεις της εκκλησίας για πολλές από τις εκδηλώσεις[7] που τελούνταν στην αντίστοιχη του Δωδεκαημέρου περίοδο ή τις νομοθεσίες[8], αυτές διατηρήθηκαν κυρίως στην ύπαιθρο[9] καθ' όλη την διάρκεια των ρωμαϊκών αυτοκρατορικών χρόνων, μέχρι τον 5ο μ.Χ. αιώνα. Σε μεταγενέστερη εποχή πολλά από τα έθιμα τους (ανταλλαγή δώρων, γλέντια, χαρτοπαίγνια κ.ο.κ.) μεταβιβάστηκαν στον εορτασμό τής Πρωτοχρονιάς[10].
        Στη Ρώμη το Ημερολόγιο του Φιλόκαλου (354 μ.Χ.) περιλαμβάνει στην ημερομηνία της 25ης Δεκεμβρίου, απέναντι από την παγανιστική Natalis invicti, δηλ. "γέννηση του ανίκητου (ήλιου)", την φράση "VIII kal. Ian. natus Christus in Betleem Iudeae." ("όγδοες καλένδες Ιανουαρίου Ο Χριστός γεννήθηκε στη Βηθλεέμ της Ιουδαίας.")
        Από τη Δύση ο εορτασμός της Γεννήσεως στις 25 Δεκεμβρίου πέρασε και στην Ανατολή γύρω στο 376. Το 386 ο Αγ. Ιωάννης ο Χρυσόστομος παρότρυνε την εκκλησία της Αντιόχειας να συμφωνήσει στην 25η Δεκεμβρίου ως ημέρα εορτασμού της Γέννησης. Τον καιρό του Αγ. Αυγουστίνου (354-430) η ημερομηνία της Γιορτής της Γέννησης είχε καθοριστεί, πάντως ο Αυγουστίνος την παραλείπει από τον κατάλογό του με τις σημαντικές χριστιανικές επετείους (PL 33.200).
        """)
        history.append("""
        Με τον χρόνο επεκράτησε σε όλο τον χριστιανικό κόσμο εκτός της Αρμενικής Ορθόδοξης Εκκλησίας που συνεχίζει τον συνεορτασμό με τα Θεοφάνια.
        Το 529 ο αυτοκράτορας Ιουστινιανός απαγόρευσε την εργασία και τα δημόσια έργα κατά τη διάρκεια των Χριστουγέννων και τα ανακήρυξε δημόσια αργία. Ως το 1100, καθώς είχε επεκταθεί η δράση των ιεραποστολών στις παγανιστικές ευρωπαϊκές φυλές, όλα τα έθνη της Ευρώπης γιόρταζαν τα Χριστούγεννα. Εντούτοις, αργότερα, εξαιτίας της Μεταρρύθμισης απαγορεύτηκε ή περιορίστηκε κατά περιόδους η τήρησή του εορτασμού τους σε διάφορες χώρες της Ευρώπης και στην Αμερική, καθώς θεωρούνταν ότι περιλάμβανε σε μεγάλο βαθμό ειδωλολατρικά στοιχεία[11].
            Η σύγχρονη Χριστουγεννιάτικη κουλτούρα διαμορφώθηκε ως επί το πλείστον τον 19ο αιώνα στη Δυτική Ευρώπη και Αμερική.[12] Οι επικριτές των σύγχρονων Χριστουγέννων κάνουν λόγο για χαρακτηριστικά εμπορευματοποίησης και υλισμού που δεν πρεσβεύουν τις αρχές του Χριστιανισμού.
        """)
        return history
    }
    func createTraditions()->[String]{
        var traditions:[String] = []
        traditions.append("""
        1.Οι Καλικάντζαροι
        Σύμφωνα με την ελληνική εκδοχή του μύθου για τα κακά πνεύματα, ο κόσμος μας συνδέεται με τον κάτω κόσμο μέσω ενός δέντρου. Τα κακά πνεύματα, οι καλικάντζαροι, ζουν κάτω από το δέντρο, ψάχνοντας να βρουν διαφυγή για τον έξω κόσμο. Καταφέρνουν να το κάνουν κατά τη διάρκεια των Δώδεκα Ημερών των Χριστουγέννων, από τις 25 Δεκεμβρίου μέχρι τις 6 Ιανουαρίου.
        Κατά τη διάρκεια της περιόδου αυτής, οι καλικάντζαροι ανεβαίνουν στο δικό μας κόσμο επειδή ο Χριστός, αφού ακόμα δεν έχει βαπτιστεί, δεν μπορεί να προστατέψει τους ανθρώπους από το κακό. Όταν τα σπίτια δεν μπορούν να προστατευθούν, τα δαιμόνια κυκλοφορούν ελεύθερα φέρνοντας προβλήματα και αναταραχές. Οι άνθρωποι τα κρατούν μακριά, καίγοντας κούτσουρα, λιβάνι, ακόμα και παλιά παπούτσια.
        """)
        traditions.append("""
        2.To Τάισμα του Πηγαδιού
        Αυτή η παράξενη παράδοση συναντάται σε διάφορες γωνιές στην ελληνική ενδοχώρα. Κατά τη διάρκεια των δώδεκα ημερών των Χριστουγέννων, οι νέες γυναίκες μεταφέρουν χωρίς να μιλούν άδειες κανάτες σε κοντινά πηγάδια και τις γεμίζουν με νερό.
        Οι γυναίκες μεταφέρουν βούτυρο, δημητριακά ή μέλι για να ευχαριστήσουν το πηγάδι. Η πρώτη γυναίκα που φτάνει στο πηγάδι θεωρείται ότι είναι ευλογημένη με πολλή τύχη μέχρι το τέλος του χρόνου.
        """)
        traditions.append("""
        3.Η Διατήρηση της Φωτιάς
        Λένε ότι ένας από τους τρόπους για να διώξει κανείς τους καλικάντζαρους είναι να έχει στο τζάκι ένα κούτσουρο μονίμως αναμμένο. Η παράδοση αναφέρεται ως “πάντρεμα της φωτιάς” ή “Χριστοκούτσουρο”. Το πάντρεμα της φωτιάς απαιτεί δυο κλαριά, το ένα από δέντρο με όνομα γένους θηλυκού και το άλλο από δέντρο με όνομα γένους αρσενικού.
        Τα κλαδιά τοποθετούνται σε σχήμα σταυρού και κάποιες φορές ο άντρας του σπιτιού ψάλλει ένα γαμήλιο όρκο προτού ανάψει τη φωτιά. Σύμφωνα με τα ελληνικά χριστουγεννιάτικα έθιμα, όσο καίει η φωτιά τα κακά πνεύματα φεύγουν μακριά.
        """)
        traditions.append("""
        4.Σκελετούρα
        Η σκελέτουρα ή ασκελέτουρα, γνωστή κι ως “μεγαλοκρέμμυδο” είναι ένας μεγάλος βολβός δύσκολος να φυτευτεί μέσα στο χώμα. Αφού συνεχίζει να ανθίζει ακόμα κι αφότου ξεριζωθεί, θεωρείται σύμβολο αιωνιότητας.
        Σύμφωνα με την παράδοση που επικρατεί κυρίως στην Κρήτη, οι οικογένειες τις κρεμούν στην πόρτα την παραμονή της Πρωτοχρονιάς και μετά τις φυλούν στο σπίτι μέχρι το τέλος του χρόνου, πιστεύοντας ότι φέρνουν μακροζωία, καλοτυχία και υγεία σε όλα τα μέλη της οικογένειας.
        """)
        traditions.append("""
        5.Η ιστορία πίσω από τη Βασιλόπιτα
        Ανάμεσα στα ελληνικά χριστουγεννιάτικα έθιμα, η Βασιλόπιτα που κόβουμε την πρώτη μέρα του έτους συνδέεται στενά με τον Άγιο Βασίλειο. Σύμφωνα με μια εκδοχή της ιστορίας, η παράδοση προέρχεται από τη ζωή του Αγίου, όταν ένας βασιλιάς είχε θεσπίσει βαριά φορολογία σε μια περίοδο μεγάλης φτώχειας. Ο κόσμος έδινε τα κοσμήματά του για να πληρώσει, κι έτσι ο Άγιος κάλεσε το βασιλιά για να μετανοήσει, κι έτσι έγινε.
        Ο βασιλιάς επέστρεψε στον κόσμο τα κοσμήματα, αλλά κανείς δε γνώριζε τι ανήκε σε ποιον, κι έτσι ο Άγιος Βασίλης αποφάσισε να βάλει τα κοσμήματα μέσα στην πίτα και να δώσει κομμάτια στον κόσμο, κι ως εκ θαύματος, όλοι έλαβαν τα κοσμήματά τους.
        """)
        traditions.append("""
        6.Το σπάσιμο του ροδιού
        Το ρόδι είναι ένα αρχαίο φρούτο που συμβολίζει τη γονιμότητα, την ευημερία και την αναγέννηση εδώ και χιλιάδες χρόνια στην Ελλάδα και την ελληνική μυθολογία. Κατά τη διάρκεια των Χριστουγέννων σχεδόν σε όλα τα ελληνικά σπίτια συναντά κανείς ρόδια, ειδικά στην είσοδο, ενώ κάποιοι πηγαίνουν το φρούτο στην εκκλησία για να το ευλογήσουν. Σύμφωνα με το έθιμο που συναντάται κυρίως στην Πελοπόννησο, λίγο πριν την αλλαγή του έτους, οι οικογένειες βγαίνουν από το σπίτι, συμβολίζοντας τον παλιό χρόνο που πέρασε. Ξαναμπαίνουν μέσα με το δεξί πόδι, ενώ αυτός που θα μπει πρώτος πετάει το ρόδι στην πόρτα για να σπάσει. Λέγεται ότι αυτή η παράδοση φέρνει καλή τύχη και ότι ο αριθμός των σπόρων που πετάγονται είναι ίσος με το μερίδιο της καλοτυχίας που θα έχει η οικογένεια την ερχόμενο χρόνο.
        """)
        traditions.append("""
        7.Οι Μωμόγεροι
        Πρόκειται για ένα Ποντιακό έθιμο που αναβιώνει στη Δράμα κι άλλες περιοχές της Βόρειας Ελλάδας. Είναι μια από τις πιο ενδιαφέρουσες χριστουγεννιάτικες παραδόσεις της Ελλάδας. Οι Μωμόγεροι είναι άνθρωποι που μιμούνται τη συμπεριφορά άλλων. Ντύνονται σαν ηλικιωμένοι και φορούν προβιές ζώων και μεγάλα μυτερά καπέλα.
        Φέρουν ξίφη κι ακόντια, περπατούν στους δρόμους την παραμονή των Χριστουγέννων, κάνοντας φασαρία και τραγουδώντας τα κάλαντα. Όταν συναντηθούν με άλλες ομάδες μωμόγερων, κάνουν ότι μαλώνουν και ο νικητής είναι ο πιο τυχερός!
        """)
        traditions.append("""
        8.Το άναμμα των φύλλων δάφνης ή ιτάμου
        Στα Ιωάννινα και σε άλλες περιοχές της ενδοχώρας, ο κόσμος αναβιώνει αυτό το παλιό έθιμο. Συγκεκριμένα, κρατούν φύλλα από δάφνη και ίταμο και μετά τους βάζουν φωτιά. Έτσι, όταν συναντούν τους γείτονες, πετούν τα αναμμένα φύλλα στο τζάκι. Αυτό είναι πράξη καλής τύχης, αφού θεωρείται ότι ο θόρυβος και ο καπνός θα διώξει τα κακά πνεύματα.
        Φυσικά, αυτή η παράδοση έχει επιρροές από τους βοσκούς που κίνησαν για να αποτίσουν φόρο τιμής στο νεογέννητο Ιησού κι επειδή δεν έβρισκαν το δρόμο, άναψαν φύλλα. Οι σπίθες και ο ήχος είναι η βάση αυτής της υπέροχης παράδοσης.
        """)
        return traditions
    }
}
